app/controllers/students_controller.rb

  def create
    @student = Student.create(params.require(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Mariel"], ["last_name", "Hoepelman"], ["created_at", "2020-01-29 03:34:53.049954"], ["updated_at", "2020-01-29 03:34:53.049954"]]

  def show
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]